virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/i2sc.h
/* -------- I2SC_SSR : (I2SC Offset: 0x10) ( /W 32) Status Set Register -------- */
#define I2SC_SSR_RXOR_Pos                     _U_(2)                                               /**< (I2SC_SSR) Receive Overrun Status Set Position */
#define I2SC_SSR_RXOR_Msk                     (_U_(0x1) << I2SC_SSR_RXOR_Pos)                      /**< (I2SC_SSR) Receive Overrun Status Set Mask */
#define I2SC_SSR_RXOR(value)                  (I2SC_SSR_RXOR_Msk & ((value) << I2SC_SSR_RXOR_Pos))
#define I2SC_SSR_TXUR_Pos                     _U_(6)                                               /**< (I2SC_SSR) Transmit Underrun Status Set Position */
#define I2SC_SSR_TXUR_Msk                     (_U_(0x1) << I2SC_SSR_TXUR_Pos)                      /**< (I2SC_SSR) Transmit Underrun Status Set Mask */
#define I2SC_SSR_TXUR(value)                  (I2SC_SSR_TXUR_Msk & ((value) << I2SC_SSR_TXUR_Pos))
#define I2SC_SSR_RXORCH_Pos                   _U_(8)                                               /**< (I2SC_SSR) Receive Overrun Per Channel Status Set Position */
#define I2SC_SSR_RXORCH_Msk                   (_U_(0x3) << I2SC_SSR_RXORCH_Pos)                    /**< (I2SC_SSR) Receive Overrun Per Channel Status Set Mask */
#define I2SC_SSR_RXORCH(value)                (I2SC_SSR_RXORCH_Msk & ((value) << I2SC_SSR_RXORCH_Pos))
#define I2SC_SSR_TXURCH_Pos                   _U_(20)                                              /**< (I2SC_SSR) Transmit Underrun Per Channel Status Set Position */
#define I2SC_SSR_TXURCH_Msk                   (_U_(0x3) << I2SC_SSR_TXURCH_Pos)                    /**< (I2SC_SSR) Transmit Underrun Per Channel Status Set Mask */
#define I2SC_SSR_TXURCH(value)                (I2SC_SSR_TXURCH_Msk & ((value) << I2SC_SSR_TXURCH_Pos))
#define I2SC_SSR_Msk                          _U_(0x00300344)                                      /**< (I2SC_SSR) Register Mask  */


/* -------- I2SC_IER : (I2SC Offset: 0x14) ( /W 32) Interrupt Enable Register -------- */
#define I2SC_IER_RXRDY_Pos                    _U_(1)                                               /**< (I2SC_IER) Receiver Ready Interrupt Enable Position */
#define I2SC_IER_RXRDY_Msk                    (_U_(0x1) << I2SC_IER_RXRDY_Pos)                     /**< (I2SC_IER) Receiver Ready Interrupt Enable Mask */
#define I2SC_IER_RXRDY(value)                 (I2SC_IER_RXRDY_Msk & ((value) << I2SC_IER_RXRDY_Pos))
#define I2SC_IER_RXOR_Pos                     _U_(2)                                               /**< (I2SC_IER) Receiver Overrun Interrupt Enable Position */
#define I2SC_IER_RXOR_Msk                     (_U_(0x1) << I2SC_IER_RXOR_Pos)                      /**< (I2SC_IER) Receiver Overrun Interrupt Enable Mask */
#define I2SC_IER_RXOR(value)                  (I2SC_IER_RXOR_Msk & ((value) << I2SC_IER_RXOR_Pos))
#define I2SC_IER_ENDRX_Pos                    _U_(3)                                               /**< (I2SC_IER) End of Reception Interrupt Enable Position */
#define I2SC_IER_ENDRX_Msk                    (_U_(0x1) << I2SC_IER_ENDRX_Pos)                     /**< (I2SC_IER) End of Reception Interrupt Enable Mask */
#define I2SC_IER_ENDRX(value)                 (I2SC_IER_ENDRX_Msk & ((value) << I2SC_IER_ENDRX_Pos))
#define I2SC_IER_TXRDY_Pos                    _U_(5)                                               /**< (I2SC_IER) Transmit Ready Interrupt Enable Position */
#define I2SC_IER_TXRDY_Msk                    (_U_(0x1) << I2SC_IER_TXRDY_Pos)                     /**< (I2SC_IER) Transmit Ready Interrupt Enable Mask */
#define I2SC_IER_TXRDY(value)                 (I2SC_IER_TXRDY_Msk & ((value) << I2SC_IER_TXRDY_Pos))
#define I2SC_IER_TXUR_Pos                     _U_(6)                                               /**< (I2SC_IER) Transmit Underflow Interrupt Enable Position */
#define I2SC_IER_TXUR_Msk                     (_U_(0x1) << I2SC_IER_TXUR_Pos)                      /**< (I2SC_IER) Transmit Underflow Interrupt Enable Mask */
#define I2SC_IER_TXUR(value)                  (I2SC_IER_TXUR_Msk & ((value) << I2SC_IER_TXUR_Pos))
#define I2SC_IER_ENDTX_Pos                    _U_(7)                                               /**< (I2SC_IER) End of Transmission Interrupt Enable Position */
#define I2SC_IER_ENDTX_Msk                    (_U_(0x1) << I2SC_IER_ENDTX_Pos)                     /**< (I2SC_IER) End of Transmission Interrupt Enable Mask */
#define I2SC_IER_ENDTX(value)                 (I2SC_IER_ENDTX_Msk & ((value) << I2SC_IER_ENDTX_Pos))
#define I2SC_IER_RXFULL_Pos                   _U_(19)                                              /**< (I2SC_IER) Receive Buffer Full Interrupt Enable Position */
#define I2SC_IER_RXFULL_Msk                   (_U_(0x1) << I2SC_IER_RXFULL_Pos)                    /**< (I2SC_IER) Receive Buffer Full Interrupt Enable Mask */
#define I2SC_IER_RXFULL(value)                (I2SC_IER_RXFULL_Msk & ((value) << I2SC_IER_RXFULL_Pos))
#define I2SC_IER_TXEMPTY_Pos                  _U_(31)                                              /**< (I2SC_IER) Transmit Buffer Empty Interrupt Enable Position */
#define I2SC_IER_TXEMPTY_Msk                  (_U_(0x1) << I2SC_IER_TXEMPTY_Pos)                   /**< (I2SC_IER) Transmit Buffer Empty Interrupt Enable Mask */
#define I2SC_IER_TXEMPTY(value)               (I2SC_IER_TXEMPTY_Msk & ((value) << I2SC_IER_TXEMPTY_Pos))
#define I2SC_IER_Msk                          _U_(0x800800EE)                                      /**< (I2SC_IER) Register Mask  */


/* -------- I2SC_IDR : (I2SC Offset: 0x18) ( /W 32) Interrupt Disable Register -------- */
#define I2SC_IDR_RXRDY_Pos                    _U_(1)                                               /**< (I2SC_IDR) Receiver Ready Interrupt Disable Position */
#define I2SC_IDR_RXRDY_Msk                    (_U_(0x1) << I2SC_IDR_RXRDY_Pos)                     /**< (I2SC_IDR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IDR_RXRDY(value)                 (I2SC_IDR_RXRDY_Msk & ((value) << I2SC_IDR_RXRDY_Pos))
#define I2SC_IDR_RXOR_Pos                     _U_(2)                                               /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IDR_RXOR_Msk                     (_U_(0x1) << I2SC_IDR_RXOR_Pos)                      /**< (I2SC_IDR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IDR_RXOR(value)                  (I2SC_IDR_RXOR_Msk & ((value) << I2SC_IDR_RXOR_Pos))
#define I2SC_IDR_ENDRX_Pos                    _U_(3)                                               /**< (I2SC_IDR) End of Reception Interrupt Disable Position */
#define I2SC_IDR_ENDRX_Msk                    (_U_(0x1) << I2SC_IDR_ENDRX_Pos)                     /**< (I2SC_IDR) End of Reception Interrupt Disable Mask */
#define I2SC_IDR_ENDRX(value)                 (I2SC_IDR_ENDRX_Msk & ((value) << I2SC_IDR_ENDRX_Pos))
#define I2SC_IDR_TXRDY_Pos                    _U_(5)                                               /**< (I2SC_IDR) Transmit Ready Interrupt Disable Position */
#define I2SC_IDR_TXRDY_Msk                    (_U_(0x1) << I2SC_IDR_TXRDY_Pos)                     /**< (I2SC_IDR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IDR_TXRDY(value)                 (I2SC_IDR_TXRDY_Msk & ((value) << I2SC_IDR_TXRDY_Pos))
#define I2SC_IDR_TXUR_Pos                     _U_(6)                                               /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IDR_TXUR_Msk                     (_U_(0x1) << I2SC_IDR_TXUR_Pos)                      /**< (I2SC_IDR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IDR_TXUR(value)                  (I2SC_IDR_TXUR_Msk & ((value) << I2SC_IDR_TXUR_Pos))
#define I2SC_IDR_ENDTX_Pos                    _U_(7)                                               /**< (I2SC_IDR) End of Transmission Interrupt Disable Position */
#define I2SC_IDR_ENDTX_Msk                    (_U_(0x1) << I2SC_IDR_ENDTX_Pos)                     /**< (I2SC_IDR) End of Transmission Interrupt Disable Mask */
#define I2SC_IDR_ENDTX(value)                 (I2SC_IDR_ENDTX_Msk & ((value) << I2SC_IDR_ENDTX_Pos))
#define I2SC_IDR_RXFULL_Pos                   _U_(19)                                              /**< (I2SC_IDR) Receive Buffer Full Interrupt Disable Position */
#define I2SC_IDR_RXFULL_Msk                   (_U_(0x1) << I2SC_IDR_RXFULL_Pos)                    /**< (I2SC_IDR) Receive Buffer Full Interrupt Disable Mask */
#define I2SC_IDR_RXFULL(value)                (I2SC_IDR_RXFULL_Msk & ((value) << I2SC_IDR_RXFULL_Pos))
#define I2SC_IDR_TXEMPTY_Pos                  _U_(31)                                              /**< (I2SC_IDR) Transmit Buffer Empty Interrupt Disable Position */
#define I2SC_IDR_TXEMPTY_Msk                  (_U_(0x1) << I2SC_IDR_TXEMPTY_Pos)                   /**< (I2SC_IDR) Transmit Buffer Empty Interrupt Disable Mask */
#define I2SC_IDR_TXEMPTY(value)               (I2SC_IDR_TXEMPTY_Msk & ((value) << I2SC_IDR_TXEMPTY_Pos))
#define I2SC_IDR_Msk                          _U_(0x800800EE)                                      /**< (I2SC_IDR) Register Mask  */


/* -------- I2SC_IMR : (I2SC Offset: 0x1C) ( R/ 32) Interrupt Mask Register -------- */
#define I2SC_IMR_RXRDY_Pos                    _U_(1)                                               /**< (I2SC_IMR) Receiver Ready Interrupt Disable Position */
#define I2SC_IMR_RXRDY_Msk                    (_U_(0x1) << I2SC_IMR_RXRDY_Pos)                     /**< (I2SC_IMR) Receiver Ready Interrupt Disable Mask */
#define I2SC_IMR_RXRDY(value)                 (I2SC_IMR_RXRDY_Msk & ((value) << I2SC_IMR_RXRDY_Pos))
#define I2SC_IMR_RXOR_Pos                     _U_(2)                                               /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Position */
#define I2SC_IMR_RXOR_Msk                     (_U_(0x1) << I2SC_IMR_RXOR_Pos)                      /**< (I2SC_IMR) Receiver Overrun Interrupt Disable Mask */
#define I2SC_IMR_RXOR(value)                  (I2SC_IMR_RXOR_Msk & ((value) << I2SC_IMR_RXOR_Pos))
#define I2SC_IMR_ENDRX_Pos                    _U_(3)                                               /**< (I2SC_IMR) End of Reception Interrupt Disable Position */
#define I2SC_IMR_ENDRX_Msk                    (_U_(0x1) << I2SC_IMR_ENDRX_Pos)                     /**< (I2SC_IMR) End of Reception Interrupt Disable Mask */
#define I2SC_IMR_ENDRX(value)                 (I2SC_IMR_ENDRX_Msk & ((value) << I2SC_IMR_ENDRX_Pos))
#define I2SC_IMR_TXRDY_Pos                    _U_(5)                                               /**< (I2SC_IMR) Transmit Ready Interrupt Disable Position */
#define I2SC_IMR_TXRDY_Msk                    (_U_(0x1) << I2SC_IMR_TXRDY_Pos)                     /**< (I2SC_IMR) Transmit Ready Interrupt Disable Mask */
#define I2SC_IMR_TXRDY(value)                 (I2SC_IMR_TXRDY_Msk & ((value) << I2SC_IMR_TXRDY_Pos))
#define I2SC_IMR_TXUR_Pos                     _U_(6)                                               /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Position */
#define I2SC_IMR_TXUR_Msk                     (_U_(0x1) << I2SC_IMR_TXUR_Pos)                      /**< (I2SC_IMR) Transmit Underflow Interrupt Disable Mask */
#define I2SC_IMR_TXUR(value)                  (I2SC_IMR_TXUR_Msk & ((value) << I2SC_IMR_TXUR_Pos))
#define I2SC_IMR_ENDTX_Pos                    _U_(7)                                               /**< (I2SC_IMR) End of Transmission Interrupt Disable Position */
#define I2SC_IMR_ENDTX_Msk                    (_U_(0x1) << I2SC_IMR_ENDTX_Pos)                     /**< (I2SC_IMR) End of Transmission Interrupt Disable Mask */
#define I2SC_IMR_ENDTX(value)                 (I2SC_IMR_ENDTX_Msk & ((value) << I2SC_IMR_ENDTX_Pos))
#define I2SC_IMR_RXFULL_Pos                   _U_(19)                                              /**< (I2SC_IMR) Receive Buffer Full Interrupt Disable Position */
#define I2SC_IMR_RXFULL_Msk                   (_U_(0x1) << I2SC_IMR_RXFULL_Pos)                    /**< (I2SC_IMR) Receive Buffer Full Interrupt Disable Mask */
#define I2SC_IMR_RXFULL(value)                (I2SC_IMR_RXFULL_Msk & ((value) << I2SC_IMR_RXFULL_Pos))
#define I2SC_IMR_TXEMPTY_Pos                  _U_(31)                                              /**< (I2SC_IMR) Transmit Buffer Empty Interrupt Disable Position */
#define I2SC_IMR_TXEMPTY_Msk                  (_U_(0x1) << I2SC_IMR_TXEMPTY_Pos)                   /**< (I2SC_IMR) Transmit Buffer Empty Interrupt Disable Mask */
#define I2SC_IMR_TXEMPTY(value)               (I2SC_IMR_TXEMPTY_Msk & ((value) << I2SC_IMR_TXEMPTY_Pos))
#define I2SC_IMR_Msk                          _U_(0x800800EE)                                      /**< (I2SC_IMR) Register Mask  */


/* -------- I2SC_RHR : (I2SC Offset: 0x20) ( R/ 32) Receiver Holding Register -------- */
#define I2SC_RHR_RHR_Pos                      _U_(0)                                               /**< (I2SC_RHR) Receiver Holding Register Position */
#define I2SC_RHR_RHR_Msk                      (_U_(0xFFFFFFFF) << I2SC_RHR_RHR_Pos)                /**< (I2SC_RHR) Receiver Holding Register Mask */
#define I2SC_RHR_RHR(value)                   (I2SC_RHR_RHR_Msk & ((value) << I2SC_RHR_RHR_Pos))  
#define I2SC_RHR_Msk                          _U_(0xFFFFFFFF)                                      /**< (I2SC_RHR) Register Mask  */


