virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/i2sc.h
/* -------- I2SC_THR : (I2SC Offset: 0x24) ( /W 32) Transmitter Holding Register -------- */
#define I2SC_THR_THR_Pos                      _U_(0)                                               /**< (I2SC_THR) Transmitter Holding Register Position */
#define I2SC_THR_THR_Msk                      (_U_(0xFFFFFFFF) << I2SC_THR_THR_Pos)                /**< (I2SC_THR) Transmitter Holding Register Mask */
#define I2SC_THR_THR(value)                   (I2SC_THR_THR_Msk & ((value) << I2SC_THR_THR_Pos))  
#define I2SC_THR_Msk                          _U_(0xFFFFFFFF)                                      /**< (I2SC_THR) Register Mask  */


/* -------- I2SC_RPR : (I2SC Offset: 0x100) (R/W 32) Receive Pointer Register - Left side -------- */
#define I2SC_RPR_RXPTR_Pos                    _U_(0)                                               /**< (I2SC_RPR) Receive Pointer Register Position */
#define I2SC_RPR_RXPTR_Msk                    (_U_(0xFFFFFFFF) << I2SC_RPR_RXPTR_Pos)              /**< (I2SC_RPR) Receive Pointer Register Mask */
#define I2SC_RPR_RXPTR(value)                 (I2SC_RPR_RXPTR_Msk & ((value) << I2SC_RPR_RXPTR_Pos))
#define I2SC_RPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (I2SC_RPR) Register Mask  */


/* -------- I2SC_RCR : (I2SC Offset: 0x104) (R/W 32) Receive Counter Register - Left side -------- */
#define I2SC_RCR_RXCTR_Pos                    _U_(0)                                               /**< (I2SC_RCR) Receive Counter Register Position */
#define I2SC_RCR_RXCTR_Msk                    (_U_(0xFFFF) << I2SC_RCR_RXCTR_Pos)                  /**< (I2SC_RCR) Receive Counter Register Mask */
#define I2SC_RCR_RXCTR(value)                 (I2SC_RCR_RXCTR_Msk & ((value) << I2SC_RCR_RXCTR_Pos))
#define I2SC_RCR_Msk                          _U_(0x0000FFFF)                                      /**< (I2SC_RCR) Register Mask  */


/* -------- I2SC_TPR : (I2SC Offset: 0x108) (R/W 32) Transmit Pointer Register - Left side -------- */
#define I2SC_TPR_TXPTR_Pos                    _U_(0)                                               /**< (I2SC_TPR) Transmit Counter Register Position */
#define I2SC_TPR_TXPTR_Msk                    (_U_(0xFFFFFFFF) << I2SC_TPR_TXPTR_Pos)              /**< (I2SC_TPR) Transmit Counter Register Mask */
#define I2SC_TPR_TXPTR(value)                 (I2SC_TPR_TXPTR_Msk & ((value) << I2SC_TPR_TXPTR_Pos))
#define I2SC_TPR_Msk                          _U_(0xFFFFFFFF)                                      /**< (I2SC_TPR) Register Mask  */


/* -------- I2SC_TCR : (I2SC Offset: 0x10C) (R/W 32) Transmit Counter Register - Left side -------- */
#define I2SC_TCR_TXCTR_Pos                    _U_(0)                                               /**< (I2SC_TCR) Transmit Counter Register Position */
#define I2SC_TCR_TXCTR_Msk                    (_U_(0xFFFF) << I2SC_TCR_TXCTR_Pos)                  /**< (I2SC_TCR) Transmit Counter Register Mask */
#define I2SC_TCR_TXCTR(value)                 (I2SC_TCR_TXCTR_Msk & ((value) << I2SC_TCR_TXCTR_Pos))
#define I2SC_TCR_Msk                          _U_(0x0000FFFF)                                      /**< (I2SC_TCR) Register Mask  */


/* -------- I2SC_RNPR : (I2SC Offset: 0x110) (R/W 32) Receive Next Pointer Register - Left side -------- */
#define I2SC_RNPR_RXNPTR_Pos                  _U_(0)                                               /**< (I2SC_RNPR) Receive Next Pointer Position */
#define I2SC_RNPR_RXNPTR_Msk                  (_U_(0xFFFFFFFF) << I2SC_RNPR_RXNPTR_Pos)            /**< (I2SC_RNPR) Receive Next Pointer Mask */
#define I2SC_RNPR_RXNPTR(value)               (I2SC_RNPR_RXNPTR_Msk & ((value) << I2SC_RNPR_RXNPTR_Pos))
#define I2SC_RNPR_Msk                         _U_(0xFFFFFFFF)                                      /**< (I2SC_RNPR) Register Mask  */


/* -------- I2SC_RNCR : (I2SC Offset: 0x114) (R/W 32) Receive Next Counter Register - Left side -------- */
#define I2SC_RNCR_RXNCTR_Pos                  _U_(0)                                               /**< (I2SC_RNCR) Receive Next Counter Position */
#define I2SC_RNCR_RXNCTR_Msk                  (_U_(0xFFFF) << I2SC_RNCR_RXNCTR_Pos)                /**< (I2SC_RNCR) Receive Next Counter Mask */
#define I2SC_RNCR_RXNCTR(value)               (I2SC_RNCR_RXNCTR_Msk & ((value) << I2SC_RNCR_RXNCTR_Pos))
#define I2SC_RNCR_Msk                         _U_(0x0000FFFF)                                      /**< (I2SC_RNCR) Register Mask  */


/* -------- I2SC_TNPR : (I2SC Offset: 0x118) (R/W 32) Transmit Next Pointer Register - Left side -------- */
#define I2SC_TNPR_TXNPTR_Pos                  _U_(0)                                               /**< (I2SC_TNPR) Transmit Next Pointer Position */
#define I2SC_TNPR_TXNPTR_Msk                  (_U_(0xFFFFFFFF) << I2SC_TNPR_TXNPTR_Pos)            /**< (I2SC_TNPR) Transmit Next Pointer Mask */
#define I2SC_TNPR_TXNPTR(value)               (I2SC_TNPR_TXNPTR_Msk & ((value) << I2SC_TNPR_TXNPTR_Pos))
#define I2SC_TNPR_Msk                         _U_(0xFFFFFFFF)                                      /**< (I2SC_TNPR) Register Mask  */


/* -------- I2SC_TNCR : (I2SC Offset: 0x11C) (R/W 32) Transmit Next Counter Register - Left side -------- */
#define I2SC_TNCR_TXNCTR_Pos                  _U_(0)                                               /**< (I2SC_TNCR) Transmit Counter Next Position */
#define I2SC_TNCR_TXNCTR_Msk                  (_U_(0xFFFF) << I2SC_TNCR_TXNCTR_Pos)                /**< (I2SC_TNCR) Transmit Counter Next Mask */
#define I2SC_TNCR_TXNCTR(value)               (I2SC_TNCR_TXNCTR_Msk & ((value) << I2SC_TNCR_TXNCTR_Pos))
#define I2SC_TNCR_Msk                         _U_(0x0000FFFF)                                      /**< (I2SC_TNCR) Register Mask  */


/* -------- I2SC_PTCR : (I2SC Offset: 0x120) ( /W 32) Transfer Control Register - Left side -------- */
#define I2SC_PTCR_RXTEN_Pos                   _U_(0)                                               /**< (I2SC_PTCR) Receiver Transfer Enable Position */
#define I2SC_PTCR_RXTEN_Msk                   (_U_(0x1) << I2SC_PTCR_RXTEN_Pos)                    /**< (I2SC_PTCR) Receiver Transfer Enable Mask */
#define I2SC_PTCR_RXTEN(value)                (I2SC_PTCR_RXTEN_Msk & ((value) << I2SC_PTCR_RXTEN_Pos))
#define I2SC_PTCR_RXTDIS_Pos                  _U_(1)                                               /**< (I2SC_PTCR) Receiver Transfer Disable Position */
#define I2SC_PTCR_RXTDIS_Msk                  (_U_(0x1) << I2SC_PTCR_RXTDIS_Pos)                   /**< (I2SC_PTCR) Receiver Transfer Disable Mask */
#define I2SC_PTCR_RXTDIS(value)               (I2SC_PTCR_RXTDIS_Msk & ((value) << I2SC_PTCR_RXTDIS_Pos))
#define I2SC_PTCR_TXTEN_Pos                   _U_(8)                                               /**< (I2SC_PTCR) Transmitter Transfer Enable Position */
#define I2SC_PTCR_TXTEN_Msk                   (_U_(0x1) << I2SC_PTCR_TXTEN_Pos)                    /**< (I2SC_PTCR) Transmitter Transfer Enable Mask */
#define I2SC_PTCR_TXTEN(value)                (I2SC_PTCR_TXTEN_Msk & ((value) << I2SC_PTCR_TXTEN_Pos))
#define I2SC_PTCR_TXTDIS_Pos                  _U_(9)                                               /**< (I2SC_PTCR) Transmitter Transfer Disable Position */
#define I2SC_PTCR_TXTDIS_Msk                  (_U_(0x1) << I2SC_PTCR_TXTDIS_Pos)                   /**< (I2SC_PTCR) Transmitter Transfer Disable Mask */
#define I2SC_PTCR_TXTDIS(value)               (I2SC_PTCR_TXTDIS_Msk & ((value) << I2SC_PTCR_TXTDIS_Pos))
#define I2SC_PTCR_RXCBEN_Pos                  _U_(16)                                              /**< (I2SC_PTCR) Receiver Circular Buffer Enable Position */
#define I2SC_PTCR_RXCBEN_Msk                  (_U_(0x1) << I2SC_PTCR_RXCBEN_Pos)                   /**< (I2SC_PTCR) Receiver Circular Buffer Enable Mask */
#define I2SC_PTCR_RXCBEN(value)               (I2SC_PTCR_RXCBEN_Msk & ((value) << I2SC_PTCR_RXCBEN_Pos))
#define I2SC_PTCR_RXCBDIS_Pos                 _U_(17)                                              /**< (I2SC_PTCR) Receiver Circular Buffer Disable Position */
#define I2SC_PTCR_RXCBDIS_Msk                 (_U_(0x1) << I2SC_PTCR_RXCBDIS_Pos)                  /**< (I2SC_PTCR) Receiver Circular Buffer Disable Mask */
#define I2SC_PTCR_RXCBDIS(value)              (I2SC_PTCR_RXCBDIS_Msk & ((value) << I2SC_PTCR_RXCBDIS_Pos))
#define I2SC_PTCR_TXCBEN_Pos                  _U_(18)                                              /**< (I2SC_PTCR) Transmitter Circular Buffer Enable Position */
#define I2SC_PTCR_TXCBEN_Msk                  (_U_(0x1) << I2SC_PTCR_TXCBEN_Pos)                   /**< (I2SC_PTCR) Transmitter Circular Buffer Enable Mask */
#define I2SC_PTCR_TXCBEN(value)               (I2SC_PTCR_TXCBEN_Msk & ((value) << I2SC_PTCR_TXCBEN_Pos))
#define I2SC_PTCR_TXCBDIS_Pos                 _U_(19)                                              /**< (I2SC_PTCR) Transmitter Circular Buffer Disable Position */
#define I2SC_PTCR_TXCBDIS_Msk                 (_U_(0x1) << I2SC_PTCR_TXCBDIS_Pos)                  /**< (I2SC_PTCR) Transmitter Circular Buffer Disable Mask */
#define I2SC_PTCR_TXCBDIS(value)              (I2SC_PTCR_TXCBDIS_Msk & ((value) << I2SC_PTCR_TXCBDIS_Pos))
#define I2SC_PTCR_ERRCLR_Pos                  _U_(24)                                              /**< (I2SC_PTCR) Transfer Bus Error Clear Position */
#define I2SC_PTCR_ERRCLR_Msk                  (_U_(0x1) << I2SC_PTCR_ERRCLR_Pos)                   /**< (I2SC_PTCR) Transfer Bus Error Clear Mask */
#define I2SC_PTCR_ERRCLR(value)               (I2SC_PTCR_ERRCLR_Msk & ((value) << I2SC_PTCR_ERRCLR_Pos))
#define I2SC_PTCR_Msk                         _U_(0x010F0303)                                      /**< (I2SC_PTCR) Register Mask  */


/* -------- I2SC_PTSR : (I2SC Offset: 0x124) ( R/ 32) Transfer Status Register - Left side -------- */
#define I2SC_PTSR_RXTEN_Pos                   _U_(0)                                               /**< (I2SC_PTSR) Receiver Transfer Enable Position */
#define I2SC_PTSR_RXTEN_Msk                   (_U_(0x1) << I2SC_PTSR_RXTEN_Pos)                    /**< (I2SC_PTSR) Receiver Transfer Enable Mask */
#define I2SC_PTSR_RXTEN(value)                (I2SC_PTSR_RXTEN_Msk & ((value) << I2SC_PTSR_RXTEN_Pos))
#define I2SC_PTSR_TXTEN_Pos                   _U_(8)                                               /**< (I2SC_PTSR) Transmitter Transfer Enable Position */
#define I2SC_PTSR_TXTEN_Msk                   (_U_(0x1) << I2SC_PTSR_TXTEN_Pos)                    /**< (I2SC_PTSR) Transmitter Transfer Enable Mask */
#define I2SC_PTSR_TXTEN(value)                (I2SC_PTSR_TXTEN_Msk & ((value) << I2SC_PTSR_TXTEN_Pos))
#define I2SC_PTSR_RXCBEN_Pos                  _U_(16)                                              /**< (I2SC_PTSR) Receiver Circular Buffer Enable Position */
#define I2SC_PTSR_RXCBEN_Msk                  (_U_(0x1) << I2SC_PTSR_RXCBEN_Pos)                   /**< (I2SC_PTSR) Receiver Circular Buffer Enable Mask */
#define I2SC_PTSR_RXCBEN(value)               (I2SC_PTSR_RXCBEN_Msk & ((value) << I2SC_PTSR_RXCBEN_Pos))
#define I2SC_PTSR_TXCBEN_Pos                  _U_(18)                                              /**< (I2SC_PTSR) Transmitter Circular Buffer Enable Position */
#define I2SC_PTSR_TXCBEN_Msk                  (_U_(0x1) << I2SC_PTSR_TXCBEN_Pos)                   /**< (I2SC_PTSR) Transmitter Circular Buffer Enable Mask */
#define I2SC_PTSR_TXCBEN(value)               (I2SC_PTSR_TXCBEN_Msk & ((value) << I2SC_PTSR_TXCBEN_Pos))
#define I2SC_PTSR_ERR_Pos                     _U_(24)                                              /**< (I2SC_PTSR) Transfer Bus Error Position */
#define I2SC_PTSR_ERR_Msk                     (_U_(0x1) << I2SC_PTSR_ERR_Pos)                      /**< (I2SC_PTSR) Transfer Bus Error Mask */
#define I2SC_PTSR_ERR(value)                  (I2SC_PTSR_ERR_Msk & ((value) << I2SC_PTSR_ERR_Pos))
#define I2SC_PTSR_Msk                         _U_(0x01050101)                                      /**< (I2SC_PTSR) Register Mask  */


/* -------- I2SC_RPR_RIGHT : (I2SC Offset: 0x200) (R/W 32) Receive Pointer Register - Right side -------- */
#define I2SC_RPR_RIGHT_RXPTR_Pos              _U_(0)                                               /**< (I2SC_RPR_RIGHT) Receive Pointer Register Position */
#define I2SC_RPR_RIGHT_RXPTR_Msk              (_U_(0xFFFFFFFF) << I2SC_RPR_RIGHT_RXPTR_Pos)        /**< (I2SC_RPR_RIGHT) Receive Pointer Register Mask */
#define I2SC_RPR_RIGHT_RXPTR(value)           (I2SC_RPR_RIGHT_RXPTR_Msk & ((value) << I2SC_RPR_RIGHT_RXPTR_Pos))
#define I2SC_RPR_RIGHT_Msk                    _U_(0xFFFFFFFF)                                      /**< (I2SC_RPR_RIGHT) Register Mask  */


/* -------- I2SC_RCR_RIGHT : (I2SC Offset: 0x204) (R/W 32) Receive Counter Register - Right side -------- */
#define I2SC_RCR_RIGHT_RXCTR_Pos              _U_(0)                                               /**< (I2SC_RCR_RIGHT) Receive Counter Register Position */
#define I2SC_RCR_RIGHT_RXCTR_Msk              (_U_(0xFFFF) << I2SC_RCR_RIGHT_RXCTR_Pos)            /**< (I2SC_RCR_RIGHT) Receive Counter Register Mask */
#define I2SC_RCR_RIGHT_RXCTR(value)           (I2SC_RCR_RIGHT_RXCTR_Msk & ((value) << I2SC_RCR_RIGHT_RXCTR_Pos))
#define I2SC_RCR_RIGHT_Msk                    _U_(0x0000FFFF)                                      /**< (I2SC_RCR_RIGHT) Register Mask  */


