virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/i2sc.h
/* -------- I2SC_TPR_RIGHT : (I2SC Offset: 0x208) (R/W 32) Transmit Pointer Register - Right side -------- */
#define I2SC_TPR_RIGHT_TXPTR_Pos              _U_(0)                                               /**< (I2SC_TPR_RIGHT) Transmit Counter Register Position */
#define I2SC_TPR_RIGHT_TXPTR_Msk              (_U_(0xFFFFFFFF) << I2SC_TPR_RIGHT_TXPTR_Pos)        /**< (I2SC_TPR_RIGHT) Transmit Counter Register Mask */
#define I2SC_TPR_RIGHT_TXPTR(value)           (I2SC_TPR_RIGHT_TXPTR_Msk & ((value) << I2SC_TPR_RIGHT_TXPTR_Pos))
#define I2SC_TPR_RIGHT_Msk                    _U_(0xFFFFFFFF)                                      /**< (I2SC_TPR_RIGHT) Register Mask  */


/* -------- I2SC_TCR_RIGHT : (I2SC Offset: 0x20C) (R/W 32) Transmit Counter Register - Right side -------- */
#define I2SC_TCR_RIGHT_TXCTR_Pos              _U_(0)                                               /**< (I2SC_TCR_RIGHT) Transmit Counter Register Position */
#define I2SC_TCR_RIGHT_TXCTR_Msk              (_U_(0xFFFF) << I2SC_TCR_RIGHT_TXCTR_Pos)            /**< (I2SC_TCR_RIGHT) Transmit Counter Register Mask */
#define I2SC_TCR_RIGHT_TXCTR(value)           (I2SC_TCR_RIGHT_TXCTR_Msk & ((value) << I2SC_TCR_RIGHT_TXCTR_Pos))
#define I2SC_TCR_RIGHT_Msk                    _U_(0x0000FFFF)                                      /**< (I2SC_TCR_RIGHT) Register Mask  */


/* -------- I2SC_RNPR_RIGHT : (I2SC Offset: 0x210) (R/W 32) Receive Next Pointer Register - Right side -------- */
#define I2SC_RNPR_RIGHT_RXNPTR_Pos            _U_(0)                                               /**< (I2SC_RNPR_RIGHT) Receive Next Pointer Position */
#define I2SC_RNPR_RIGHT_RXNPTR_Msk            (_U_(0xFFFFFFFF) << I2SC_RNPR_RIGHT_RXNPTR_Pos)      /**< (I2SC_RNPR_RIGHT) Receive Next Pointer Mask */
#define I2SC_RNPR_RIGHT_RXNPTR(value)         (I2SC_RNPR_RIGHT_RXNPTR_Msk & ((value) << I2SC_RNPR_RIGHT_RXNPTR_Pos))
#define I2SC_RNPR_RIGHT_Msk                   _U_(0xFFFFFFFF)                                      /**< (I2SC_RNPR_RIGHT) Register Mask  */


/* -------- I2SC_RNCR_RIGHT : (I2SC Offset: 0x214) (R/W 32) Receive Next Counter Register - Right side -------- */
#define I2SC_RNCR_RIGHT_RXNCTR_Pos            _U_(0)                                               /**< (I2SC_RNCR_RIGHT) Receive Next Counter Position */
#define I2SC_RNCR_RIGHT_RXNCTR_Msk            (_U_(0xFFFF) << I2SC_RNCR_RIGHT_RXNCTR_Pos)          /**< (I2SC_RNCR_RIGHT) Receive Next Counter Mask */
#define I2SC_RNCR_RIGHT_RXNCTR(value)         (I2SC_RNCR_RIGHT_RXNCTR_Msk & ((value) << I2SC_RNCR_RIGHT_RXNCTR_Pos))
#define I2SC_RNCR_RIGHT_Msk                   _U_(0x0000FFFF)                                      /**< (I2SC_RNCR_RIGHT) Register Mask  */


/* -------- I2SC_TNPR_RIGHT : (I2SC Offset: 0x218) (R/W 32) Transmit Next Pointer Register - Right side -------- */
#define I2SC_TNPR_RIGHT_TXNPTR_Pos            _U_(0)                                               /**< (I2SC_TNPR_RIGHT) Transmit Next Pointer Position */
#define I2SC_TNPR_RIGHT_TXNPTR_Msk            (_U_(0xFFFFFFFF) << I2SC_TNPR_RIGHT_TXNPTR_Pos)      /**< (I2SC_TNPR_RIGHT) Transmit Next Pointer Mask */
#define I2SC_TNPR_RIGHT_TXNPTR(value)         (I2SC_TNPR_RIGHT_TXNPTR_Msk & ((value) << I2SC_TNPR_RIGHT_TXNPTR_Pos))
#define I2SC_TNPR_RIGHT_Msk                   _U_(0xFFFFFFFF)                                      /**< (I2SC_TNPR_RIGHT) Register Mask  */


/* -------- I2SC_TNCR_RIGHT : (I2SC Offset: 0x21C) (R/W 32) Transmit Next Counter Register - Right side -------- */
#define I2SC_TNCR_RIGHT_TXNCTR_Pos            _U_(0)                                               /**< (I2SC_TNCR_RIGHT) Transmit Counter Next Position */
#define I2SC_TNCR_RIGHT_TXNCTR_Msk            (_U_(0xFFFF) << I2SC_TNCR_RIGHT_TXNCTR_Pos)          /**< (I2SC_TNCR_RIGHT) Transmit Counter Next Mask */
#define I2SC_TNCR_RIGHT_TXNCTR(value)         (I2SC_TNCR_RIGHT_TXNCTR_Msk & ((value) << I2SC_TNCR_RIGHT_TXNCTR_Pos))
#define I2SC_TNCR_RIGHT_Msk                   _U_(0x0000FFFF)                                      /**< (I2SC_TNCR_RIGHT) Register Mask  */


/* -------- I2SC_PTCR_RIGHT : (I2SC Offset: 0x220) ( /W 32) Transfer Control Register - Right side -------- */
#define I2SC_PTCR_RIGHT_RXTEN_Pos             _U_(0)                                               /**< (I2SC_PTCR_RIGHT) Receiver Transfer Enable Position */
#define I2SC_PTCR_RIGHT_RXTEN_Msk             (_U_(0x1) << I2SC_PTCR_RIGHT_RXTEN_Pos)              /**< (I2SC_PTCR_RIGHT) Receiver Transfer Enable Mask */
#define I2SC_PTCR_RIGHT_RXTEN(value)          (I2SC_PTCR_RIGHT_RXTEN_Msk & ((value) << I2SC_PTCR_RIGHT_RXTEN_Pos))
#define I2SC_PTCR_RIGHT_RXTDIS_Pos            _U_(1)                                               /**< (I2SC_PTCR_RIGHT) Receiver Transfer Disable Position */
#define I2SC_PTCR_RIGHT_RXTDIS_Msk            (_U_(0x1) << I2SC_PTCR_RIGHT_RXTDIS_Pos)             /**< (I2SC_PTCR_RIGHT) Receiver Transfer Disable Mask */
#define I2SC_PTCR_RIGHT_RXTDIS(value)         (I2SC_PTCR_RIGHT_RXTDIS_Msk & ((value) << I2SC_PTCR_RIGHT_RXTDIS_Pos))
#define I2SC_PTCR_RIGHT_TXTEN_Pos             _U_(8)                                               /**< (I2SC_PTCR_RIGHT) Transmitter Transfer Enable Position */
#define I2SC_PTCR_RIGHT_TXTEN_Msk             (_U_(0x1) << I2SC_PTCR_RIGHT_TXTEN_Pos)              /**< (I2SC_PTCR_RIGHT) Transmitter Transfer Enable Mask */
#define I2SC_PTCR_RIGHT_TXTEN(value)          (I2SC_PTCR_RIGHT_TXTEN_Msk & ((value) << I2SC_PTCR_RIGHT_TXTEN_Pos))
#define I2SC_PTCR_RIGHT_TXTDIS_Pos            _U_(9)                                               /**< (I2SC_PTCR_RIGHT) Transmitter Transfer Disable Position */
#define I2SC_PTCR_RIGHT_TXTDIS_Msk            (_U_(0x1) << I2SC_PTCR_RIGHT_TXTDIS_Pos)             /**< (I2SC_PTCR_RIGHT) Transmitter Transfer Disable Mask */
#define I2SC_PTCR_RIGHT_TXTDIS(value)         (I2SC_PTCR_RIGHT_TXTDIS_Msk & ((value) << I2SC_PTCR_RIGHT_TXTDIS_Pos))
#define I2SC_PTCR_RIGHT_RXCBEN_Pos            _U_(16)                                              /**< (I2SC_PTCR_RIGHT) Receiver Circular Buffer Enable Position */
#define I2SC_PTCR_RIGHT_RXCBEN_Msk            (_U_(0x1) << I2SC_PTCR_RIGHT_RXCBEN_Pos)             /**< (I2SC_PTCR_RIGHT) Receiver Circular Buffer Enable Mask */
#define I2SC_PTCR_RIGHT_RXCBEN(value)         (I2SC_PTCR_RIGHT_RXCBEN_Msk & ((value) << I2SC_PTCR_RIGHT_RXCBEN_Pos))
#define I2SC_PTCR_RIGHT_RXCBDIS_Pos           _U_(17)                                              /**< (I2SC_PTCR_RIGHT) Receiver Circular Buffer Disable Position */
#define I2SC_PTCR_RIGHT_RXCBDIS_Msk           (_U_(0x1) << I2SC_PTCR_RIGHT_RXCBDIS_Pos)            /**< (I2SC_PTCR_RIGHT) Receiver Circular Buffer Disable Mask */
#define I2SC_PTCR_RIGHT_RXCBDIS(value)        (I2SC_PTCR_RIGHT_RXCBDIS_Msk & ((value) << I2SC_PTCR_RIGHT_RXCBDIS_Pos))
#define I2SC_PTCR_RIGHT_TXCBEN_Pos            _U_(18)                                              /**< (I2SC_PTCR_RIGHT) Transmitter Circular Buffer Enable Position */
#define I2SC_PTCR_RIGHT_TXCBEN_Msk            (_U_(0x1) << I2SC_PTCR_RIGHT_TXCBEN_Pos)             /**< (I2SC_PTCR_RIGHT) Transmitter Circular Buffer Enable Mask */
#define I2SC_PTCR_RIGHT_TXCBEN(value)         (I2SC_PTCR_RIGHT_TXCBEN_Msk & ((value) << I2SC_PTCR_RIGHT_TXCBEN_Pos))
#define I2SC_PTCR_RIGHT_TXCBDIS_Pos           _U_(19)                                              /**< (I2SC_PTCR_RIGHT) Transmitter Circular Buffer Disable Position */
#define I2SC_PTCR_RIGHT_TXCBDIS_Msk           (_U_(0x1) << I2SC_PTCR_RIGHT_TXCBDIS_Pos)            /**< (I2SC_PTCR_RIGHT) Transmitter Circular Buffer Disable Mask */
#define I2SC_PTCR_RIGHT_TXCBDIS(value)        (I2SC_PTCR_RIGHT_TXCBDIS_Msk & ((value) << I2SC_PTCR_RIGHT_TXCBDIS_Pos))
#define I2SC_PTCR_RIGHT_ERRCLR_Pos            _U_(24)                                              /**< (I2SC_PTCR_RIGHT) Transfer Bus Error Clear Position */
#define I2SC_PTCR_RIGHT_ERRCLR_Msk            (_U_(0x1) << I2SC_PTCR_RIGHT_ERRCLR_Pos)             /**< (I2SC_PTCR_RIGHT) Transfer Bus Error Clear Mask */
#define I2SC_PTCR_RIGHT_ERRCLR(value)         (I2SC_PTCR_RIGHT_ERRCLR_Msk & ((value) << I2SC_PTCR_RIGHT_ERRCLR_Pos))
#define I2SC_PTCR_RIGHT_Msk                   _U_(0x010F0303)                                      /**< (I2SC_PTCR_RIGHT) Register Mask  */


/* -------- I2SC_PTSR_RIGHT : (I2SC Offset: 0x224) ( R/ 32) Transfer Status Register - Right side -------- */
#define I2SC_PTSR_RIGHT_RXTEN_Pos             _U_(0)                                               /**< (I2SC_PTSR_RIGHT) Receiver Transfer Enable Position */
#define I2SC_PTSR_RIGHT_RXTEN_Msk             (_U_(0x1) << I2SC_PTSR_RIGHT_RXTEN_Pos)              /**< (I2SC_PTSR_RIGHT) Receiver Transfer Enable Mask */
#define I2SC_PTSR_RIGHT_RXTEN(value)          (I2SC_PTSR_RIGHT_RXTEN_Msk & ((value) << I2SC_PTSR_RIGHT_RXTEN_Pos))
#define I2SC_PTSR_RIGHT_TXTEN_Pos             _U_(8)                                               /**< (I2SC_PTSR_RIGHT) Transmitter Transfer Enable Position */
#define I2SC_PTSR_RIGHT_TXTEN_Msk             (_U_(0x1) << I2SC_PTSR_RIGHT_TXTEN_Pos)              /**< (I2SC_PTSR_RIGHT) Transmitter Transfer Enable Mask */
#define I2SC_PTSR_RIGHT_TXTEN(value)          (I2SC_PTSR_RIGHT_TXTEN_Msk & ((value) << I2SC_PTSR_RIGHT_TXTEN_Pos))
#define I2SC_PTSR_RIGHT_RXCBEN_Pos            _U_(16)                                              /**< (I2SC_PTSR_RIGHT) Receiver Circular Buffer Enable Position */
#define I2SC_PTSR_RIGHT_RXCBEN_Msk            (_U_(0x1) << I2SC_PTSR_RIGHT_RXCBEN_Pos)             /**< (I2SC_PTSR_RIGHT) Receiver Circular Buffer Enable Mask */
#define I2SC_PTSR_RIGHT_RXCBEN(value)         (I2SC_PTSR_RIGHT_RXCBEN_Msk & ((value) << I2SC_PTSR_RIGHT_RXCBEN_Pos))
#define I2SC_PTSR_RIGHT_TXCBEN_Pos            _U_(18)                                              /**< (I2SC_PTSR_RIGHT) Transmitter Circular Buffer Enable Position */
#define I2SC_PTSR_RIGHT_TXCBEN_Msk            (_U_(0x1) << I2SC_PTSR_RIGHT_TXCBEN_Pos)             /**< (I2SC_PTSR_RIGHT) Transmitter Circular Buffer Enable Mask */
#define I2SC_PTSR_RIGHT_TXCBEN(value)         (I2SC_PTSR_RIGHT_TXCBEN_Msk & ((value) << I2SC_PTSR_RIGHT_TXCBEN_Pos))
#define I2SC_PTSR_RIGHT_ERR_Pos               _U_(24)                                              /**< (I2SC_PTSR_RIGHT) Transfer Bus Error Position */
#define I2SC_PTSR_RIGHT_ERR_Msk               (_U_(0x1) << I2SC_PTSR_RIGHT_ERR_Pos)                /**< (I2SC_PTSR_RIGHT) Transfer Bus Error Mask */
#define I2SC_PTSR_RIGHT_ERR(value)            (I2SC_PTSR_RIGHT_ERR_Msk & ((value) << I2SC_PTSR_RIGHT_ERR_Pos))
#define I2SC_PTSR_RIGHT_Msk                   _U_(0x01050101)                                      /**< (I2SC_PTSR_RIGHT) Register Mask  */


/** \brief I2SC register offsets definitions */
#define I2SC_CR_REG_OFST               (0x00)              /**< (I2SC_CR) Control Register Offset */
#define I2SC_MR_REG_OFST               (0x04)              /**< (I2SC_MR) Mode Register Offset */
#define I2SC_SR_REG_OFST               (0x08)              /**< (I2SC_SR) Status Register Offset */
#define I2SC_SCR_REG_OFST              (0x0C)              /**< (I2SC_SCR) Status Clear Register Offset */
#define I2SC_SSR_REG_OFST              (0x10)              /**< (I2SC_SSR) Status Set Register Offset */
#define I2SC_IER_REG_OFST              (0x14)              /**< (I2SC_IER) Interrupt Enable Register Offset */
#define I2SC_IDR_REG_OFST              (0x18)              /**< (I2SC_IDR) Interrupt Disable Register Offset */
#define I2SC_IMR_REG_OFST              (0x1C)              /**< (I2SC_IMR) Interrupt Mask Register Offset */
#define I2SC_RHR_REG_OFST              (0x20)              /**< (I2SC_RHR) Receiver Holding Register Offset */
#define I2SC_THR_REG_OFST              (0x24)              /**< (I2SC_THR) Transmitter Holding Register Offset */
#define I2SC_RPR_REG_OFST              (0x100)             /**< (I2SC_RPR) Receive Pointer Register - Left side Offset */
#define I2SC_RCR_REG_OFST              (0x104)             /**< (I2SC_RCR) Receive Counter Register - Left side Offset */
#define I2SC_TPR_REG_OFST              (0x108)             /**< (I2SC_TPR) Transmit Pointer Register - Left side Offset */
#define I2SC_TCR_REG_OFST              (0x10C)             /**< (I2SC_TCR) Transmit Counter Register - Left side Offset */
#define I2SC_RNPR_REG_OFST             (0x110)             /**< (I2SC_RNPR) Receive Next Pointer Register - Left side Offset */
#define I2SC_RNCR_REG_OFST             (0x114)             /**< (I2SC_RNCR) Receive Next Counter Register - Left side Offset */
#define I2SC_TNPR_REG_OFST             (0x118)             /**< (I2SC_TNPR) Transmit Next Pointer Register - Left side Offset */
#define I2SC_TNCR_REG_OFST             (0x11C)             /**< (I2SC_TNCR) Transmit Next Counter Register - Left side Offset */
#define I2SC_PTCR_REG_OFST             (0x120)             /**< (I2SC_PTCR) Transfer Control Register - Left side Offset */
#define I2SC_PTSR_REG_OFST             (0x124)             /**< (I2SC_PTSR) Transfer Status Register - Left side Offset */
#define I2SC_RPR_RIGHT_REG_OFST        (0x200)             /**< (I2SC_RPR_RIGHT) Receive Pointer Register - Right side Offset */
#define I2SC_RCR_RIGHT_REG_OFST        (0x204)             /**< (I2SC_RCR_RIGHT) Receive Counter Register - Right side Offset */
#define I2SC_TPR_RIGHT_REG_OFST        (0x208)             /**< (I2SC_TPR_RIGHT) Transmit Pointer Register - Right side Offset */
#define I2SC_TCR_RIGHT_REG_OFST        (0x20C)             /**< (I2SC_TCR_RIGHT) Transmit Counter Register - Right side Offset */
#define I2SC_RNPR_RIGHT_REG_OFST       (0x210)             /**< (I2SC_RNPR_RIGHT) Receive Next Pointer Register - Right side Offset */
#define I2SC_RNCR_RIGHT_REG_OFST       (0x214)             /**< (I2SC_RNCR_RIGHT) Receive Next Counter Register - Right side Offset */
#define I2SC_TNPR_RIGHT_REG_OFST       (0x218)             /**< (I2SC_TNPR_RIGHT) Transmit Next Pointer Register - Right side Offset */
#define I2SC_TNCR_RIGHT_REG_OFST       (0x21C)             /**< (I2SC_TNCR_RIGHT) Transmit Next Counter Register - Right side Offset */
#define I2SC_PTCR_RIGHT_REG_OFST       (0x220)             /**< (I2SC_PTCR_RIGHT) Transfer Control Register - Right side Offset */
#define I2SC_PTSR_RIGHT_REG_OFST       (0x224)             /**< (I2SC_PTSR_RIGHT) Transfer Status Register - Right side Offset */

