virtualabs/cutcutgo/cutcutgo.X/src/packs/ATSAMG55J19_DFP/component/i2sc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief I2SC register API structure */
typedef struct
{
  __O   uint32_t                       I2SC_CR;            /**< Offset: 0x00 ( /W  32) Control Register */
  __IO  uint32_t                       I2SC_MR;            /**< Offset: 0x04 (R/W  32) Mode Register */
  __I   uint32_t                       I2SC_SR;            /**< Offset: 0x08 (R/   32) Status Register */
  __O   uint32_t                       I2SC_SCR;           /**< Offset: 0x0C ( /W  32) Status Clear Register */
  __O   uint32_t                       I2SC_SSR;           /**< Offset: 0x10 ( /W  32) Status Set Register */
  __O   uint32_t                       I2SC_IER;           /**< Offset: 0x14 ( /W  32) Interrupt Enable Register */
  __O   uint32_t                       I2SC_IDR;           /**< Offset: 0x18 ( /W  32) Interrupt Disable Register */
  __I   uint32_t                       I2SC_IMR;           /**< Offset: 0x1C (R/   32) Interrupt Mask Register */
  __I   uint32_t                       I2SC_RHR;           /**< Offset: 0x20 (R/   32) Receiver Holding Register */
  __O   uint32_t                       I2SC_THR;           /**< Offset: 0x24 ( /W  32) Transmitter Holding Register */
  __I   uint8_t                        Reserved1[0xD8];
  __IO  uint32_t                       I2SC_RPR;           /**< Offset: 0x100 (R/W  32) Receive Pointer Register - Left side */
  __IO  uint32_t                       I2SC_RCR;           /**< Offset: 0x104 (R/W  32) Receive Counter Register - Left side */
  __IO  uint32_t                       I2SC_TPR;           /**< Offset: 0x108 (R/W  32) Transmit Pointer Register - Left side */
  __IO  uint32_t                       I2SC_TCR;           /**< Offset: 0x10C (R/W  32) Transmit Counter Register - Left side */
  __IO  uint32_t                       I2SC_RNPR;          /**< Offset: 0x110 (R/W  32) Receive Next Pointer Register - Left side */
  __IO  uint32_t                       I2SC_RNCR;          /**< Offset: 0x114 (R/W  32) Receive Next Counter Register - Left side */
  __IO  uint32_t                       I2SC_TNPR;          /**< Offset: 0x118 (R/W  32) Transmit Next Pointer Register - Left side */
  __IO  uint32_t                       I2SC_TNCR;          /**< Offset: 0x11C (R/W  32) Transmit Next Counter Register - Left side */
  __O   uint32_t                       I2SC_PTCR;          /**< Offset: 0x120 ( /W  32) Transfer Control Register - Left side */
  __I   uint32_t                       I2SC_PTSR;          /**< Offset: 0x124 (R/   32) Transfer Status Register - Left side */
  __I   uint8_t                        Reserved2[0xD8];
  __IO  uint32_t                       I2SC_RPR_RIGHT;     /**< Offset: 0x200 (R/W  32) Receive Pointer Register - Right side */
  __IO  uint32_t                       I2SC_RCR_RIGHT;     /**< Offset: 0x204 (R/W  32) Receive Counter Register - Right side */
  __IO  uint32_t                       I2SC_TPR_RIGHT;     /**< Offset: 0x208 (R/W  32) Transmit Pointer Register - Right side */
  __IO  uint32_t                       I2SC_TCR_RIGHT;     /**< Offset: 0x20C (R/W  32) Transmit Counter Register - Right side */
  __IO  uint32_t                       I2SC_RNPR_RIGHT;    /**< Offset: 0x210 (R/W  32) Receive Next Pointer Register - Right side */
  __IO  uint32_t                       I2SC_RNCR_RIGHT;    /**< Offset: 0x214 (R/W  32) Receive Next Counter Register - Right side */
  __IO  uint32_t                       I2SC_TNPR_RIGHT;    /**< Offset: 0x218 (R/W  32) Transmit Next Pointer Register - Right side */
  __IO  uint32_t                       I2SC_TNCR_RIGHT;    /**< Offset: 0x21C (R/W  32) Transmit Next Counter Register - Right side */
  __O   uint32_t                       I2SC_PTCR_RIGHT;    /**< Offset: 0x220 ( /W  32) Transfer Control Register - Right side */
  __I   uint32_t                       I2SC_PTSR_RIGHT;    /**< Offset: 0x224 (R/   32) Transfer Status Register - Right side */
} i2sc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMG55_I2SC_COMPONENT_H_ */
